app/views/projects/index.html.erb

  <% @projects.each do |project| %>
    <% proposals = Proposal.all.where(project_id: project.id).first(2) %>
---
SELECT  "proposals".* FROM "proposals" WHERE "proposals"."project_id" = $1 ORDER BY "proposals"."id" ASC LIMIT $2  [["project_id", 1], ["LIMIT", 2]]