app/controllers/projects_controller.rb

SELECT "projects".* FROM "projects" WHERE "projects"."government_id" = $1  [["government_id", 1]]
---
  def index
    @projects = Project.all.where(government_id: Government.find(params[:government_id]).id)