app/controllers/proposals_controller.rb

SELECT  "governments".* FROM "governments" WHERE "governments"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]
SELECT  "projects".* FROM "projects" WHERE "projects"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]
SELECT "proposals".* FROM "proposals" WHERE "proposals"."project_id" = $1  [["project_id", 1]]
---
  def index
    @government = Government.find(params[:government_id])
    @project = Project.find(params[:project_id])
    @proposals = Proposal.all.where(project_id: @project.id)